src/main/resources/public/Request/AddressDoc/Request.xml

<!-- Request Sample for Batch  --->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.tibco.com/schemas/ISS_AddressDoctorCommonSvc/SharedResources/SchemaDefinition/Custom/xsd/SCH_AddressValidationBatchReqRes.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <sch:AddressValidationBatchReq>
         <!--Zero or more repetitions:-->
         <sch:AddressValidationBatchReq>
            <!--Optional:-->
            <sch:Street1>111 Rover Street</sch:Street1>
            <!--Optional:-->
            <sch:Street2></sch:Street2>
            <!--Optional:-->
            <sch:Street3>?</sch:Street3>
            <!--Optional:-->
            <sch:Locality1>Hoboken</sch:Locality1>
            <!--Optional:-->
            <sch:Locality2>?</sch:Locality2>
            <!--Optional:-->
            <sch:Locality3>?</sch:Locality3>
            <!--Optional:-->
            <sch:PostCode/>
            <!--Optional:-->
            <sch:Province1>NJ</sch:Province1>
            <!--Optional:-->
            <sch:Province2>?</sch:Province2>
            <!--Optional:-->
            <sch:Province3>?</sch:Province3>
            <!--Optional:-->
            <sch:CountryName>US</sch:CountryName>
            <!--Optional:-->
            <sch:Organization1>?</sch:Organization1>
            <!--Optional:-->
            <sch:Organization2>?</sch:Organization2>
            <!--Optional:-->
            <sch:Building1>?</sch:Building1>
            <!--Optional:-->
            <sch:Building2>?</sch:Building2>
            <!--Optional:-->
            <sch:OrganizationDepartment1>?</sch:OrganizationDepartment1>
            <!--Optional:-->
            <sch:OrganizationDepartment2>?</sch:OrganizationDepartment2>
         </sch:AddressValidationBatchReq>
      </sch:AddressValidationBatchReq>
   </soapenv:Body>
</soapenv:Envelope>

<!-- Request Sample for Interactive  --->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.tibco.com/schemas/ISS_AddressDoctorCommonSvc/SharedResources/SchemaDefinition/Custom/xsd/SCH_AddressValidationMultiReqRes.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <sch:AddressValidationMultiReq>
         <sch:AddressValidationMultiReq>
            <!--Optional:-->
            <sch:Street1> Rover Street</sch:Street1>
            <!--Optional:-->
            <sch:Street2></sch:Street2>
            <!--Optional:-->
            <sch:Street3></sch:Street3>
            <!--Optional:-->
            <sch:Locality1>Hoboken</sch:Locality1>
            <!--Optional:-->
            <sch:Locality2></sch:Locality2>
            <!--Optional:-->
            <sch:Locality3></sch:Locality3>
            <!--Optional:-->
            <sch:PostCode></sch:PostCode>
            <!--Optional:-->
            <sch:Province1>NJ</sch:Province1>
            <!--Optional:-->
            <sch:Province2></sch:Province2>
            <!--Optional:-->
            <sch:Province3></sch:Province3>
            <!--Optional:-->
            <sch:CountryName>US</sch:CountryName>
            <!--Optional:-->
            <sch:Organization1></sch:Organization1>
            <!--Optional:-->
            <sch:Organization2></sch:Organization2>
            <!--Optional:-->
            <sch:Building1></sch:Building1>
            <!--Optional:-->
            <sch:Building2></sch:Building2>
            <!--Optional:-->
            <sch:OrganizationDepartment1></sch:OrganizationDepartment1>
            <!--Optional:-->
            <sch:OrganizationDepartment2></sch:OrganizationDepartment2>
         </sch:AddressValidationMultiReq>
      </sch:AddressValidationMultiReq>
   </soapenv:Body>
</soapenv:Envelope>